"use strict";

(() => {
  const TITLES = [
    `Роскошные апартаменты, идеальное место для постоянного проживания `,
    `Дом для отпуска с садом и расскошной террасой`,
    `Уютное бунгало, бирюзово-молочный тёплый океан`,
    `Очаровательная старинная вилла с потрясающим видом на озеро`,
    `Отличные стильные апартаменты, все продумано до мелочей`,
    `Прекрасная светлая квартира с видом на горы в доме Бизнес класса`,
    `Королевская вилла с личным бассейном`,
    `Маленький уютный домик в дали от суеты`
  ];

  const TYPES = [`palace`, `flat`, `house`, `bungalo`];

  const CHECK_IN_OUT = [`12:00`, `13:00`, `14:00`];

  const FEATURES = [`wifi`, `dishwasher`, `parking`, `washer`, `elevator`, `conditioner`];

  const PHOTOS = [
    `http://o0.github.io/assets/images/tokyo/hotel1.jpg`,
    `http://o0.github.io/assets/images/tokyo/hotel2.jpg`,
    `http://o0.github.io/assets/images/tokyo/hotel3.jpg`
  ];

  const DESCRIPTIONS = [
    `Нереально чистое и очень хорошо оборудованное пространство.`,
    `Отличное место для отдыха с семьёй и компанией.`,
    `Тихое место, расслабляющая атмосфера. Вкусные завтраки.`,
    `Потрясающий вариант для романтичного уикенда.`,
    `Всё на высоте, вид из балкона божественный.`,
    `Просторно, уютно. Красивая природа вокруг.`,
    `Удобное расположение. Идеально для того, чтобы оставиться на одну ночь.`,
    `Изумительная атмосфера. Все очень удобно и комфортно.`
  ];

  const typesOfAccommodation = {
    palace: `Дворец`,
    flat: `Квартира`,
    house: `Дом`,
    bungalo: `Бунгало`,
  };

  window.data = {
    TITLES,
    TYPES,
    CHECK_IN_OUT,
    FEATURES,
    PHOTOS,
    DESCRIPTIONS,
    typesOfAccommodation
  };
})();
